import pywikibot

list_of_page = [
    # "ويكيبيديا:مستخدمو الأسبوع الأكثر نشاطا/الأسبوع ال02 2024",
    "ويكيبيديا:مستخدمو الأسبوع الأكثر نشاطا/الأسبوع ال02 2024/مقالات",
    "ويكيبيديا:مستخدمو الأسبوع الأكثر نشاطا/الأسبوع ال02 2024/تعديلات",
    "ويكيبيديا:مستخدمو الأسبوع الأكثر نشاطا/الأسبوع ال02 2024/مراجعة المقالات",
    "ويكيبيديا:مستخدمو الأسبوع الأكثر نشاطا/الأسبوع ال02 2024/إدارة",
    "ويكيبيديا:مستخدمو الأسبوع الأكثر نشاطا/الأسبوع ال02 2024/إضافة نصوص",
    "ويكيبيديا:مستخدمو الأسبوع الأكثر نشاطا/الأسبوع ال02 2024/مراجعة التعديلات",
    "ويكيبيديا:مستخدمو الأسبوع الأكثر نشاطا/الأسبوع ال02 2024/جدد",
    "ويكيبيديا:مستخدمو الأسبوع الأكثر نشاطا/الأسبوع ال02 2024/بوتات"
]

site = pywikibot.Site("ar", "wikipedia")
for item in list_of_page:
    page = pywikibot.Page(site, item)
    page.move(
        newtitle=item.replace("ال02", "ال2"),
        movetalk=True,
        reason="تعديل",
    )
